# ConnectorGenderType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ConnectorGenderType Property
ParameterTypeId Class See Also
---
"Connector Gender Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ConnectorGenderType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConnectorGenderType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ConnectorGenderType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace